Revit 2027 API
ParameterTypeId.BoundaryConditionsType Property
 "Boundary Conditions Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryConditionsType { get; }
Public Shared ReadOnly Property BoundaryConditionsType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryConditionsType {
	ForgeTypeId^ get ();
}
static member BoundaryConditionsType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace